steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
  uint32_t enterMs = millis();
#if INKTIME_PHOTOPAINTER_ENABLED
  uint32_t lastPowerCheckMs = enterMs;
  bool usbServiceActive = photoPainter.usbConnected();
#endif

  for (;;) {
    server.handleClient();

#if INKTIME_PHOTOPAINTER_ENABLED
    if (millis() - lastPowerCheckMs >= 5000) {
      photoPainter.refreshPowerState();
      lastPowerCheckMs = millis();
      if (usbServiceActive && !photoPainter.usbConnected()) {
        goDeepSleepMinutes(minutesToNextRefreshFromLastEpoch(g_cfg));
      }
      usbServiceActive = photoPainter.usbConnected();
    }
#else
    const bool usbServiceActive = false;
#endif

    if (!usbServiceActive && millis() - enterMs > AP_TIMEOUT_MS) {
#if DEBUG_LOG
      DBG_PRINTLN("[AP] timeout: no config saved");
#endif
      uint32_t mins = minutesToNextRefreshFromLastEpoch(g_cfg);
#if DEBUG_LOG
      DBG_PRINT("[AP] sleep to next refresh, minutes="); DBG_PRINTLN((int)mins);
#endif
      delay(50);
      goDeepSleepMinutes(mins);
    }

    delay(10);
  }
}

#if INKTIME_PHOTOPAINTER_ENABLED
// A confirmed USB source keeps the existing configuration WebServer available.
// The project has no MQTT client to migrate; battery operation remains one-shot.
bool runUsbServiceMode() {
  photoPainter.refreshPowerState();
  if (!photoPainter.usbConnected()) return false;
  // USB power alone is not authorization to alter Wi-Fi or a device token.
  if (!isFactoryResetRequestedAtBoot()) return false;
  portalSetupSecret = randomPortalSecret();
  portalNonce = randomPortalSecret();
  portalSaveAttempts = 0;
  portalSaveAllowed = true;

  server.on("/", HTTP_GET, handleRoot);
  server.on("/save", HTTP_POST, handleSave);
  server.begin();
#if DEBUG_LOG
  DBG_PRINTLN("[USB] configuration WebServer remains awake until VBUS removal");
#endif

  uint32_t lastPowerCheckMs = millis();
  while (photoPainter.usbConnected()) {
    server.handleClient();
    if (millis() - lastPowerCheckMs >= 5000) {
      photoPainter.refreshPowerState();
      lastPowerCheckMs = millis();
    }
    delay(10);
  }
  server.stop();
  return true;
}
#endif

// =======================
//  WiFi 连接
// =======================
static constexpr uint8_t kWiFiFastPathMaxChannel = 14U;
static constexpr uint32_t kWiFiFastPathTimeoutMs = 3500U;

static bool validBssid(const uint8_t* bssid) {
  if (bssid == nullptr) return false;
  bool allZero = true;
  bool allFf = true;
  for (uint8_t index = 0U; index < 6U; ++index) {
    allZero = allZero && bssid[index] == 0U;
    allFf = allFf && bssid[index] == 0xffU;
  }
  return !allZero && !allFf;
}

static bool loadWiFiFastPathHint(uint8_t* bssid, uint8_t& channel) {
  if (bssid == nullptr) return false;
  prefs.begin("dashcfg", true);
  const size_t length = prefs.getBytesLength("wifi_bssid");
  const size_t read = length == 6U ? prefs.getBytes("wifi_bssid", bssid, 6U) : 0U;
  channel = prefs.getUChar("wifi_channel", 0U);
  prefs.end();
  return read == 6U && channel > 0U && channel <= kWiFiFastPathMaxChannel
      && validBssid(bssid);
}

static void saveWiFiFastPathHint() {
  const uint8_t* bssid = WiFi.BSSID();
  const uint8_t channel = WiFi.channel();
  if (!validBssid(bssid) || channel == 0U || channel > kWiFiFastPathMaxChannel) return;
  prefs.begin("dashcfg", false);
  const size_t written = prefs.putBytes("wifi_bssid", bssid, 6U);
  const size_t channelWritten = prefs.putUChar("wifi_channel", channel);
  prefs.end();
  if (written == 6U) recordNvsWrite();
  if (channelWritten > 0U) recordNvsWrite();
}

static bool waitForWiFi(uint32_t timeout_ms) {
  const uint32_t started = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - started < timeout_ms) {
    delay(200);
#if DEBUG_LOG
    DBG_PRINT(".");
#endif
  }
  return WiFi.status() == WL_CONNECTED;
}

bool connectWiFi(const Config &cfg, uint32_t timeout_ms = 12000) {
#if DEBUG_LOG
  DBG_PRINTLN("[WIFI] connectWiFi()");
  DBG_PRINT("[WIFI] target ssid="); DBG_PRINTLN(cfg.wifi_ssid);
#endif

  const uint32_t started = millis();
  runtimeTelemetry.wifi_fast_path_attempted = false;
  runtimeTelemetry.wifi_fast_path_success = false;
  if (cfg.wifi_ssid.isEmpty()) {
    runtimeTelemetry.wifi_connect_ms = millis() - started;
    return false;
  }

  WiFi.disconnect(false, false);
  WiFi.mode(WIFI_STA);

  WiFi.setSleep(true);
  uint8_t cachedBssid[6] = {0U, 0U, 0U, 0U, 0U, 0U};
  uint8_t cachedChannel = 0U;
  bool ok = false;
  if (loadWiFiFastPathHint(cachedBssid, cachedChannel) && timeout_ms > 0U) {
    runtimeTelemetry.wifi_fast_path_attempted = true;
    const uint32_t fastTimeout = min(timeout_ms, kWiFiFastPathTimeoutMs);
    WiFi.begin(
      cfg.wifi_ssid.c_str(), cfg.wifi_pass.c_str(), cachedChannel, cachedBssid, true);
    ok = waitForWiFi(fastTimeout);
    runtimeTelemetry.wifi_fast_path_success = ok;
    if (!ok) WiFi.disconnect(false, false);
  }
  if (!ok && millis() - started < timeout_ms) {
    WiFi.begin(cfg.wifi_ssid.c_str(), cfg.wifi_pass.c_str());
    ok = waitForWiFi(timeout_ms - (millis() - started));
  }
#if DEBUG_LOG
  DBG_PRINTLN();
#endif

  runtimeTelemetry.wifi_connect_ms = millis() - started;
  if (ok) saveWiFiFastPathHint();

#if DEBUG_LOG
  if (ok) {
    DBG_PRINTLN("[WIFI] connected");
    DBG_PRINT("[WIFI] IP="); DBG_PRINTLN(WiFi.localIP());
  } else {
    DBG_PRINTLN("[WIFI] connect FAILED");
  }
#endif

  return ok;
}

// =======================
//  NTP 同步时间
// =======================
static constexpr uint64_t kNtpDueIntervalSeconds = 7ULL * 24ULL * 60ULL * 60ULL;

static bool loadLastNtpEpoch(time_t& epochOut) {
  prefs.begin("dashcfg", true);
  const uint32_t value = prefs.getULong("last_ntp", 0U);
  prefs.end();
  if (value < kPairingMinimumEpoch) return false;
  epochOut = static_cast<time_t>(value);
  return true;
}

static void saveLastNtpEpoch(time_t epoch) {
  if (epoch < static_cast<time_t>(kPairingMinimumEpoch)) return;
  prefs.begin("dashcfg", false);
  const size_t written = prefs.putULong("last_ntp", static_cast<uint32_t>(epoch));
  prefs.end();
  if (written > 0U) recordNvsWrite();
}

static bool localTimeFromSystemClock(struct tm& outLocal) {
  const time_t now = time(nullptr);
  if (now < static_cast<time_t>(kPairingMinimumEpoch)) return false;
  localtime_r(&now, &outLocal);
  return true;
}

static bool seedTimeFromRtc(const Config& cfg, struct tm& outLocal) {
#if INKTIME_PHOTOPAINTER_ENABLED
  time_t rtcEpoch = 0;
  if (photoPainter.readRtc(rtcEpoch) && rtcEpoch >= static_cast<time_t>(kPairingMinimumEpoch)) {
    applyFixedTimezoneWithoutNtp(cfg.tz_offset_minutes);
    struct timeval value = {rtcEpoch, 0};
    settimeofday(&value, nullptr);
    localtime_r(&rtcEpoch, &outLocal);
    return true;
  }
#else
  time_t storedEpoch = 0;
  if (loadLastTimeEpoch(storedEpoch)
      && storedEpoch >= static_cast<time_t>(kPairingMinimumEpoch)) {
    applyFixedTimezoneWithoutNtp(cfg.tz_offset_minutes);
    struct timeval value = {storedEpoch, 0};
    settimeofday(&value, nullptr);
    localtime_r(&storedEpoch, &outLocal);
    return true;
  }
#endif
  return localTimeFromSystemClock(outLocal);
}

static bool ntpDue(bool clockValid) {
  if (!clockValid) return true;
  time_t lastNtp = 0;
  if (!loadLastNtpEpoch(lastNtp)) return true;
  const time_t now = time(nullptr);
  return now < lastNtp || static_cast<uint64_t>(now - lastNtp) >= kNtpDueIntervalSeconds;
}

bool syncTime(const Config &cfg, struct tm &outLocal, bool forceNtp = false) {
#if DEBUG_LOG
  DBG_PRINTLN("[TIME] syncTime start");
#endif
  runtimeTelemetry.ntp_sync_attempted = false;
  runtimeTelemetry.ntp_sync_succeeded = false;
  runtimeTelemetry.ntp_sync_ms = 0;
  const bool seeded = seedTimeFromRtc(cfg, outLocal);
  if (!forceNtp && !ntpDue(seeded)) return seeded;
  runtimeTelemetry.ntp_sync_attempted = true;
  const uint32_t started = millis();
  long offsetSec = (long)cfg.tz_offset_minutes * 60;
  configTime(offsetSec, 0, "pool.ntp.org", "time.nist.gov", "ntp.aliyun.com");

  for (int i = 0; i < 30; ++i) {
    if (getLocalTime(&outLocal)
        && sntp_get_sync_status() == SNTP_SYNC_STATUS_COMPLETED) {
#if DEBUG_LOG
      char buf[64];
      strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", &outLocal);
      DBG_PRINT("[TIME] OK: "); DBG_PRINTLN(buf);
#endif
      time_t nowEpoch = time(nullptr);
      if (nowEpoch > 0) {
        saveLastTimeEpoch(nowEpoch);
        saveLastNtpEpoch(nowEpoch);
#if INKTIME_PHOTOPAINTER_ENABLED
        photoPainter.writeRtc(nowEpoch);
#endif
      }
      runtimeTelemetry.ntp_sync_succeeded = true;
      runtimeTelemetry.ntp_sync_ms = millis() - started;
      return true;
    }
    delay(500);
  }
#if DEBUG_LOG
  DBG_PRINTLN("[TIME] syncTime FAILED");
#endif
  runtimeTelemetry.ntp_sync_ms = millis() - started;
#if INKTIME_PHOTOPAINTER_ENABLED
  time_t rtcEpoch = 0;
  if (photoPainter.readRtc(rtcEpoch)
      && rtcEpoch >= static_cast<time_t>(kPairingMinimumEpoch)) {
    applyFixedTimezoneWithoutNtp(cfg.tz_offset_minutes);
    struct timeval value = {rtcEpoch, 0};
    settimeofday(&value, nullptr);
    localtime_r(&rtcEpoch, &outLocal);
#if DEBUG_LOG
    DBG_PRINTLN("[TIME] restored from PCF85063");
#endif
    return true;
  }
#endif
  return false;
}

static bool normalizedBackendBase(const Config &cfg, String &base) {
  base = cfg.backend_hostport;
  base.trim();
  if (!base.startsWith("http://") && !base.startsWith("https://")) base = "https://" + base;
  while (base.endsWith("/")) base.remove(base.length() - 1U);
  const int schemeEnd = base.indexOf("://");
  const String origin = schemeEnd >= 0 ? base.substring(schemeEnd + 3) : String("");
  if (origin.length() == 0U || origin.indexOf('/') >= 0 || origin.indexOf('?') >= 0
      || origin.indexOf('#') >= 0 || origin.indexOf('@') >= 0) {
    lastDeviceErrorCode = "DEVICE-BACKEND-ORIGIN";
    lastDeviceErrorMessage = "Backend 必須是不含帳密、路徑、Query 或 Fragment 的 Origin";
    return false;
  }
  return backendTransportAllowed(base, cfg.ca_pem);
}

static constexpr uint32_t kPairingPollWindowMs = 30000U;
static constexpr uint32_t kPairingPollDelayMs = 3000U;

static uint64_t pairingNowEpoch() {
  time_t now = time(nullptr);
  if (now >= static_cast<time_t>(kPairingMinimumEpoch)) return static_cast<uint64_t>(now);
  if (loadLastTimeEpoch(now) && now >= static_cast<time_t>(kPairingMinimumEpoch)) {
    return static_cast<uint64_t>(now);
  }
  return 0U;
}

static uint64_t pairingRetryNowEpoch() {
  const time_t now = time(nullptr);
  return now >= static_cast<time_t>(kPairingMinimumEpoch)
    ? static_cast<uint64_t>(now) : 0U;
}

static uint32_t pairingBackoffForAttempt(uint8_t attempt) {
  return inktime::pairing::backoffSeconds(attempt);
}

static bool pairingRetryDue(const Config &cfg) {
  return inktime::pairing::retryDue(
    retryStateFromConfig(cfg), pairingRetryNowEpoch());
}

static uint32_t pairingBackoffSeconds(const Config &cfg) {
  return inktime::pairing::sleepSeconds(
    retryStateFromConfig(cfg), pairingRetryNowEpoch());
}

static bool pairingExpiryPassed(const Config &cfg) {
  const uint64_t now = pairingNowEpoch();
  return cfg.pairing_expires_at_epoch != 0U
    && now != 0U
    && now >= cfg.pairing_expires_at_epoch;
}

static bool savePairingCandidate(Config &cfg, const Config &candidate) {
  String persistError;
  if (!saveConfig(candidate, &persistError)) {
    setConfigPersistenceError(persistError);
    return false;
  }
  cfg = candidate;
  return true;
}

static bool persistPairingRetry(Config &cfg, const String &state) {
  Config candidate = cfg;
  candidate.auth_state = state;
  const uint8_t previousAttempt = candidate.pairing_retry_attempt;
  candidate.pairing_retry_attempt = previousAttempt < 8U
    ? static_cast<uint8_t>(previousAttempt + 1U) : 8U;
  const uint64_t now = pairingNowEpoch();
  candidate.pairing_retry_at_epoch = now == 0U
    ? 0U : now + pairingBackoffForAttempt(previousAttempt);
  return savePairingCandidate(cfg, candidate);
}

static bool persistRepairPermissionRetry(Config &cfg) {
  PairingRetryMetadataStore retryStore;
  const inktime::pairing::RetryState current = retryStateFromConfig(cfg);
  const inktime::pairing::RetryState next = inktime::pairing::nextRetryState(
    current, pairingRetryNowEpoch());
  applyRetryStateToConfig(next, cfg);
  if (!(next == current)) {
    String error;
    if (!retryStore.save(next, error)) {
      setConfigPersistenceError(error);
      return false;
    }
  }
  return true;
}

static bool clearRepairPermissionRetry() {
  PairingRetryMetadataStore retryStore;
  String error;
  if (!retryStore.clear(error)) {
    setConfigPersistenceError(error);
    return false;
  }
  return true;
}

static bool persistPairingExpired(Config &cfg) {
  Config candidate = cfg;
  // An unconfirmed envelope is no longer usable after expiry.  Clear its
  // locally persisted material so a fresh enrollment can proceed.  If this
  // was a repair flow for an existing device, the backend's
  // repair_allowed_until gate still requires a new explicit admin permission
  // before the next request can succeed.
  candidate.auth_state = "pairing_expired";
  candidate.credential_version = 0U;
  candidate.device_secret = "";
  candidate.pairing_id = "";
  candidate.pairing_nonce = "";
  candidate.pairing_expires_at_epoch = 0U;
  const uint8_t previousAttempt = candidate.pairing_retry_attempt;
  candidate.pairing_retry_attempt = previousAttempt < 8U
    ? static_cast<uint8_t>(previousAttempt + 1U) : 8U;
  const uint64_t now = pairingNowEpoch();
  candidate.pairing_retry_at_epoch = now == 0U
    ? 0U : now + pairingBackoffForAttempt(previousAttempt);
  return savePairingCandidate(cfg, candidate);
}

static bool automaticPairingAllowed(const Config &cfg) {
#if INKTIME_PHOTOPAINTER_ENABLED
  if (cfg.delivery_mode == "stock_compat") return false;
#endif
  if (cfg.auth_state == "credential_issued") {
    return cfg.device_secret.length() > 0U
      && cfg.pairing_id.length() > 0U
      && cfg.pairing_nonce.length() > 0U
      && pairingRetryDue(cfg);
  }
  if (cfg.auth_state != "unpaired" && cfg.auth_state != "pairing_pending"
      && cfg.auth_state != "pairing_expired") return false;
  const bool credentialCanBeIssued = cfg.device_secret.length() == 0U
    && cfg.device_token.length() == 0U;
  if (cfg.auth_state != "pairing_pending" && !credentialCanBeIssued) return false;
  return pairingRetryDue(cfg);
}

static bool checkRepairPermission(Config &cfg) {
  if (cfg.auth_state != "auth_invalid" && cfg.auth_state != "revoked") return false;
  if (deviceCredential(cfg).length() == 0U) {
    lastDeviceErrorCode = "DEVICE-PAIRING-PERMISSION-CREDENTIAL";
    lastDeviceErrorMessage = "重新配對 permission 缺少現有 credential；本輪停止網路工作";
    if (!persistRepairPermissionRetry(cfg)) return false;
    return false;
  }
  String base;
  if (!normalizedBackendBase(cfg, base)) {
    if (!persistRepairPermissionRetry(cfg)) return false;
    return false;
  }

  inktime::DeviceHttpTransport transport(cfg.ca_pem);
  HTTPClient http;
  String transportCode;
  String transportMessage;
  if (!transport.begin(
        http, base + String(DEVICE_PAIRING_REPAIR_PERMISSION_PATH), 15000,
        transportCode, transportMessage)) {
    lastDeviceErrorCode = transportCode.length() ? transportCode : "DEVICE-PAIRING-PERMISSION-URL";
    lastDeviceErrorMessage = transportMessage.length() ? transportMessage : "重新配對 permission URL 無法初始化";
    if (!persistRepairPermissionRetry(cfg)) return false;
    return false;
  }
  if (!addDeviceAuthorization(http, cfg, true)) {
    http.end();
    if (!persistRepairPermissionRetry(cfg)) return false;
    return false;
  }
  const char* headers[] = {"Content-Type"};
  http.collectHeaders(headers, 1);
  const int status = countedHttpGet(http);
  const int length = http.getSize();
  const String contentType = http.header("Content-Type");
  if (status != HTTP_CODE_OK || length <= 0 || length > 2048
      || !contentType.startsWith("application/json")) {
    http.end();
    lastDeviceErrorCode = "DEVICE-PAIRING-PERMISSION";
    lastDeviceErrorMessage = "管理員尚未允許重新配對；本輪不建立 pairing request";
    if (!persistRepairPermissionRetry(cfg)) return false;
    return false;
  }
  JsonDocument response;
  const DeserializationError jsonError = deserializeJson(response, http.getStream());
  http.end();
  const String statusValue = response["status"] | "";
  const String authorizedDeviceId = response["device_id"] | "";
  if (jsonError || response.overflowed() || statusValue != "pairing_allowed"
      || authorizedDeviceId != cfg.device_id) {
    lastDeviceErrorCode = "DEVICE-PAIRING-PERMISSION-SCHEMA";
    lastDeviceErrorMessage = "重新配對 permission response schema 不合法";
    if (!persistRepairPermissionRetry(cfg)) return false;
    return false;
  }
  Config candidate = cfg;
  candidate.auth_state = "pairing_pending";
  candidate.pairing_id = "";
  candidate.pairing_nonce = "";
  candidate.pairing_expires_at_epoch = 0U;
  candidate.pairing_retry_at_epoch = 0U;
  candidate.pairing_retry_attempt = 0U;
  if (!savePairingCandidate(cfg, candidate)) return false;
  return clearRepairPermissionRetry();
}

static bool confirmPairingCredential(Config &cfg, const String &base) {
  if (cfg.device_secret.length() == 0U || cfg.credential_version == 0U
      || cfg.device_id.length() == 0U || cfg.pairing_id.length() == 0U
      || cfg.pairing_nonce.length() == 0U) return false;
  JsonDocument confirmRequest;
  confirmRequest["pairing_id"] = cfg.pairing_id;
  confirmRequest["device_id"] = cfg.device_id;
  confirmRequest["pairing_nonce"] = cfg.pairing_nonce;
  String confirmBody;
  serializeJson(confirmRequest, confirmBody);

  inktime::DeviceHttpTransport transport(cfg.ca_pem);
  HTTPClient http;
  String transportCode;
  String transportMessage;
  if (!transport.begin(
        http, base + String(DEVICE_PAIRING_CONFIRM_PATH), 15000,
        transportCode, transportMessage)) {
    (void)persistPairingRetry(cfg, "credential_issued");
    lastDeviceErrorCode = transportCode.length() ? transportCode : "DEVICE-PAIRING-CONFIRM-URL";
    lastDeviceErrorMessage = transportMessage.length() ? transportMessage : "配對 confirm URL 無法初始化";
    return false;
  }
  const char* headers[] = {"Content-Type"};
  http.collectHeaders(headers, 1);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("Authorization", "Bearer " + cfg.device_secret);
  http.addHeader("X-InkTime-Credential-Version", String(cfg.credential_version));
  const int status = countedHttpPost(http, confirmBody);
  const int length = http.getSize();
  const String contentType = http.header("Content-Type");
  if (status == HTTP_CODE_GONE) {
    http.end();
    (void)persistPairingExpired(cfg);
    lastDeviceErrorCode = "DEVICE-PAIRING-EXPIRED";
    lastDeviceErrorMessage = "credential envelope 已過期；等待管理員明確允許 repair";
    return false;
  }
  if (status != HTTP_CODE_OK || length <= 0 || length > 4096
      || !contentType.startsWith("application/json")) {
    http.end();
    (void)persistPairingRetry(cfg, "credential_issued");
    lastDeviceErrorCode = "DEVICE-PAIRING-CONFIRM";
    lastDeviceErrorMessage = "配對 credential 尚未完成 confirm；保留暫存 credential 供下次恢復";
    return false;
  }
  JsonDocument response;
  const DeserializationError jsonError = deserializeJson(response, http.getStream());
  http.end();
  const String statusValue = response["status"] | "";
  const String confirmedDeviceId = response["device_id"] | "";
  if (jsonError || response.overflowed()
      || (statusValue != "confirmed" && statusValue != "already_confirmed")
      || confirmedDeviceId != cfg.device_id) {
    (void)persistPairingRetry(cfg, "credential_issued");
    lastDeviceErrorCode = "DEVICE-PAIRING-CONFIRM-SCHEMA";
    lastDeviceErrorMessage = "配對 confirm response schema 不合法；保留暫存 credential";
    return false;
  }
  Config candidate = cfg;
  candidate.auth_state = "paired";
  candidate.pairing_id = "";
  candidate.pairing_nonce = "";
  candidate.pairing_expires_at_epoch = 0U;
  candidate.pairing_retry_at_epoch = 0U;
  candidate.pairing_retry_attempt = 0U;
  if (!savePairingCandidate(cfg, candidate)) return false;
  deviceAuthInvalid = false;
  lastDeviceErrorCode = "";
  lastDeviceErrorMessage = "";
  return true;
}

