steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
static bool claimPairingCredential(Config &cfg, const String &base) {
  if (cfg.pairing_id.length() == 0U || cfg.pairing_nonce.length() == 0U
      || pairingExpiryPassed(cfg)) {
    (void)persistPairingExpired(cfg);
    lastDeviceErrorCode = "DEVICE-PAIRING-EXPIRED";
    lastDeviceErrorMessage = "配對請求已過期；等待 bounded backoff 後重新建立";
    return false;
  }
  const uint32_t pollStarted = millis();
  while (static_cast<uint32_t>(millis() - pollStarted) < kPairingPollWindowMs) {
    JsonDocument claimRequest;
    claimRequest["pairing_id"] = cfg.pairing_id;
    claimRequest["pairing_nonce"] = cfg.pairing_nonce;
    String claimBody;
    serializeJson(claimRequest, claimBody);
    inktime::DeviceHttpTransport transport(cfg.ca_pem);
    HTTPClient http;
    String transportCode;
    String transportMessage;
    if (!transport.begin(
          http, base + String(DEVICE_PAIRING_CLAIM_PATH), 15000,
          transportCode, transportMessage)) {
      (void)persistPairingRetry(cfg, "pairing_pending");
      lastDeviceErrorCode = transportCode.length() ? transportCode : "DEVICE-PAIRING-CLAIM-URL";
      lastDeviceErrorMessage = transportMessage.length() ? transportMessage : "配對 claim URL 無法初始化";
      return false;
    }
    const char* headers[] = {"Content-Type"};
    http.collectHeaders(headers, 1);
    http.addHeader("Content-Type", "application/json");
    const int status = countedHttpPost(http, claimBody);
    const int length = http.getSize();
    const String contentType = http.header("Content-Type");
    if (status == HTTP_CODE_ACCEPTED) {
      http.end();
      delay(kPairingPollDelayMs);
      continue;
    }
    if (status == HTTP_CODE_GONE) {
      http.end();
      (void)persistPairingExpired(cfg);
      lastDeviceErrorCode = "DEVICE-PAIRING-EXPIRED";
      lastDeviceErrorMessage = "配對請求已過期；等待 bounded backoff 後重新建立";
      return false;
    }
    if (status != HTTP_CODE_OK || length <= 0 || length > 8192
        || !contentType.startsWith("application/json")) {
      http.end();
      (void)persistPairingRetry(cfg, "pairing_pending");
      lastDeviceErrorCode = "DEVICE-PAIRING-CLAIM";
      lastDeviceErrorMessage = "配對 claim HTTP／Content-Type／長度不合法；保留 pairing state";
      return false;
    }
    JsonDocument response;
    const DeserializationError jsonError = deserializeJson(response, http.getStream());
    http.end();
    const String secret = response["device_secret"] | "";
    const JsonVariantConst versionValue = response["credential_version"];
    const String claimedDeviceId = response["device_id"] | "";
    if (jsonError || response.overflowed() || secret.length() < 32U
        || secret.length() > inktime::configstore::kMaxDeviceSecretBytes
        || !versionValue.is<uint32_t>() || versionValue.is<bool>() || versionValue.as<uint32_t>() == 0U
        || claimedDeviceId != cfg.device_id) {
      (void)persistPairingRetry(cfg, "pairing_pending");
      lastDeviceErrorCode = "DEVICE-PAIRING-SCHEMA";
      lastDeviceErrorMessage = "配對 claim credential schema 不合法；保留 pairing state";
      return false;
    }
    Config candidate = cfg;
    candidate.device_secret = secret;
    candidate.credential_version = versionValue.as<uint32_t>();
    candidate.auth_state = "credential_issued";
#if INKTIME_PHOTOPAINTER_ENABLED
    JsonObject claimConfig = response["config"].as<JsonObject>();
    const String delivery = claimConfig["delivery_mode"] | candidate.delivery_mode;
    const String button = claimConfig["button_wake_action"] | candidate.button_wake_action;
    if (validDeliveryMode(delivery)) candidate.delivery_mode = delivery;
    if (validButtonWakeAction(button)) candidate.button_wake_action = button;
#endif
    candidate.pairing_retry_at_epoch = 0U;
    candidate.pairing_retry_attempt = 0U;
    if (!savePairingCandidate(cfg, candidate)) return false;
    return confirmPairingCredential(cfg, base);
  }
  (void)persistPairingRetry(cfg, "pairing_pending");
  lastDeviceErrorCode = "DEVICE-PAIRING-TIMEOUT";
  lastDeviceErrorMessage = "管理員核准尚未完成；保留 pairing state 並等待 bounded backoff";
  return false;
}

static bool performAutomaticPairing(Config &cfg) {
  if (!automaticPairingAllowed(cfg)) {
    return cfg.auth_state == "paired" && deviceCredential(cfg).length() > 0U && !deviceAuthInvalid;
  }
  String base;
  if (!normalizedBackendBase(cfg, base)) return false;

  if (cfg.auth_state == "credential_issued") {
    return confirmPairingCredential(cfg, base);
  }
  if (cfg.auth_state == "pairing_pending" && cfg.pairing_id.length() > 0U
      && cfg.pairing_nonce.length() > 0U) {
    return claimPairingCredential(cfg, base);
  }

  Config identityCandidate = cfg;
  if (identityCandidate.device_id.length() == 0U) {
    identityCandidate.device_id = String("esp32-") + randomPortalSecret();
    if (!savePairingCandidate(cfg, identityCandidate)) return false;
  }
  const String pairingNonce = cfg.pairing_nonce.length() > 0U
    ? cfg.pairing_nonce : randomPortalSecret();
  // Commit the nonce before the network request.  If the request reaches the
  // server but its response is lost during a power cut, the next wake can
  // repeat the same nonce and recover the original enrollment instead of
  // creating a second identity or getting stuck on a nonce conflict.
  Config requestCandidate = cfg;
  requestCandidate.auth_state = "pairing_pending";
  requestCandidate.pairing_id = "";
  requestCandidate.pairing_nonce = pairingNonce;
  requestCandidate.pairing_expires_at_epoch = 0U;
  requestCandidate.pairing_retry_at_epoch = 0U;
  if (!savePairingCandidate(cfg, requestCandidate)) return false;
  JsonDocument pairingRequest;
  pairingRequest["device_id"] = cfg.device_id;
  pairingRequest["pairing_nonce"] = pairingNonce;
  pairingRequest["firmware_identity"] = kBoardConfig.name;
  pairingRequest["firmware_version"] = INKTIME_FIRMWARE_VERSION;
  pairingRequest["panel_profile"] = INKTIME_PANEL_PROFILE;
  JsonObject capabilities = pairingRequest["capabilities"].to<JsonObject>();
  capabilities["automatic_pairing"] = true;
  capabilities["ab_credential_store"] = true;
  capabilities["stock_compatibility"] = true;
  capabilities["deep_sleep"] = true;
  String requestBody;
  serializeJson(pairingRequest, requestBody);

