steven87090799/InkTime/esp32/ink-display-7C-photo/ink-display-7C-photo.ino
static bool validatedActiveScheduleVersion(uint32_t& versionOut) {
  versionOut = 0U;
  String activeJson;
  if (!photoPainter.readActiveSchedule(activeJson)) return false;
  JsonDocument active;
  if (deserializeJson(active, activeJson) || active.overflowed()) return false;
  const String scheduleId = active["schedule_id"] | "";
  const String syncStrategy = active["sync_strategy"] | "first_display_lead";
  const String syncTime = active["sync_time"] | "";
  const JsonVariantConst rawVersion = active["offline_schedule_version"];
  const JsonArrayConst slots = active["slots"].as<JsonArrayConst>();
  if (scheduleId.isEmpty() || !inktime::boundedText(
        scheduleId.c_str(), inktime::kQueueIdentifierMaxBytes)
      || !validSyncStrategy(syncStrategy, syncTime)
      || !rawVersion.is<int32_t>() || rawVersion.is<bool>()
      || rawVersion.as<int32_t>() < 0 || slots.isNull() || slots.size() == 0U
      || slots.size() > inktime::kMaxOfflineSlots) {
    return false;
  }
  for (size_t index = 0U; index < slots.size(); ++index) {
    const JsonVariantConst rawSlot = slots[index];
    if (!rawSlot.is<JsonObjectConst>()) return false;
    const JsonObjectConst slot = rawSlot.as<JsonObjectConst>();
    const JsonVariantConst rawIndex = slot["slot_index"];
    const JsonVariantConst rawShowAt = slot["show_at_epoch"];
    const String slotScheduleId = slot["offline_schedule_id"] | "";
    const String queueItemId = slot["queue_item_id"] | "";
    const String releaseId = slot["release_id"] | "";
    const String sha = slot["sha256"] | "";
    if (!rawIndex.is<int32_t>() || rawIndex.is<bool>()
        || rawIndex.as<int32_t>() != static_cast<int32_t>(index)
        || !rawShowAt.is<int64_t>() || rawShowAt.is<bool>()
        || rawShowAt.as<int64_t>() <= 0 || slotScheduleId != scheduleId
        || !inktime::boundedText(queueItemId.c_str(), inktime::kQueueIdentifierMaxBytes)
        || !inktime::boundedText(releaseId.c_str(), inktime::kQueueIdentifierMaxBytes)
        || !inktime::isSha256Hex(sha.c_str())) {
      return false;
    }
  }
  versionOut = static_cast<uint32_t>(rawVersion.as<int32_t>());
  return true;
}

static time_t fixedDailySyncEpoch(const String& syncTime, time_t nowEpoch) {
  if (!validSyncTime(syncTime) || syncTime.isEmpty() || nowEpoch <= 0) return 0;
  struct tm localNow = {};
  localtime_r(&nowEpoch, &localNow);
  struct tm candidate = localNow;
  candidate.tm_hour = syncTime.substring(0, 2).toInt();
  candidate.tm_min = syncTime.substring(3, 5).toInt();
  candidate.tm_sec = 0;
  time_t candidateEpoch = mktime(&candidate);
  if (candidateEpoch <= nowEpoch) {
    candidate.tm_mday += 1;
    candidateEpoch = mktime(&candidate);
  }
  return candidateEpoch > nowEpoch ? candidateEpoch : 0;
}

static bool fixedDailySyncDue(const String& syncTime, time_t nowEpoch) {
  if (!validSyncTime(syncTime) || syncTime.isEmpty() || nowEpoch <= 0) return false;
  struct tm localNow = {};
  localtime_r(&nowEpoch, &localNow);
  struct tm candidate = localNow;
  candidate.tm_hour = syncTime.substring(0, 2).toInt();
  candidate.tm_min = syncTime.substring(3, 5).toInt();
  candidate.tm_sec = 0;
  const time_t candidateEpoch = mktime(&candidate);
  constexpr time_t kFixedDailyDueWindowSeconds = 5 * 60;
  return candidateEpoch > 0 && nowEpoch >= candidateEpoch
    && nowEpoch - candidateEpoch <= kFixedDailyDueWindowSeconds;
}

static bool runtimeSyncFields(
    const Config& cfg, String& strategyOut, String& syncTimeOut) {
  strategyOut = cfg.sync_strategy;
  syncTimeOut = cfg.sync_time;
  String activeJson;
  JsonDocument active;
  if (photoPainter.readActiveSchedule(activeJson)
      && !deserializeJson(active, activeJson) && !active.overflowed()) {
    strategyOut = active["sync_strategy"] | strategyOut;
    syncTimeOut = active["sync_time"] | syncTimeOut;
  }
  if (strategyOut.isEmpty()) strategyOut = "first_display_lead";
  return validSyncStrategy(strategyOut, syncTimeOut);
}

static bool offlineFixedDailySyncDue(const Config& cfg, time_t nowEpoch) {
  if (cfg.delivery_mode != "inktime_offline_schedule") return false;
  String strategy;
  String syncTime;
  if (!runtimeSyncFields(cfg, strategy, syncTime)) return false;
  return strategy == "fixed_daily" && fixedDailySyncDue(syncTime, nowEpoch);
}

#endif

static void nextRuntimeEpochs(
    const Config& cfg,
    time_t nowEpoch,
    int64_t& nextWakeOut,
    int64_t& nextSyncOut) {
  nextWakeOut = 0;
  nextSyncOut = 0;
  if (nowEpoch <= 0) return;
#if INKTIME_PHOTOPAINTER_ENABLED
  if (cfg.delivery_mode == "inktime_offline_schedule") {
    String strategy;
    String syncTime;
    if (!runtimeSyncFields(cfg, strategy, syncTime)) return;
    if (strategy == "fixed_daily") {
      nextSyncOut = fixedDailySyncEpoch(syncTime, nowEpoch);
    } else {
      time_t nextDisplay = 0;
      time_t targetEnd = 0;
      time_t nextSchedulePrefetch = 0;
      if (activeOfflineEpochs(nowEpoch, nextDisplay, targetEnd, nextSchedulePrefetch)) {
        if (nextDisplay > nowEpoch) {
          const time_t lead = static_cast<time_t>(cfg.prefetch_lead_minutes) * 60;
          nextSyncOut = nextDisplay > lead ? nextDisplay - lead : nextDisplay;
          if (nextSyncOut <= nowEpoch) nextSyncOut = nextDisplay;
        }
        if (nextSchedulePrefetch > nowEpoch
            && (nextSyncOut == 0 || nextSchedulePrefetch < nextSyncOut)) {
          nextSyncOut = nextSchedulePrefetch;
        }
      }
    }
    time_t nextDisplay = 0;
    time_t targetEnd = 0;
    time_t nextSchedulePrefetch = 0;
    if (activeOfflineEpochs(nowEpoch, nextDisplay, targetEnd, nextSchedulePrefetch)) {
      const auto consider = [nowEpoch, &nextWakeOut](time_t candidate) {
        if (candidate > nowEpoch && (nextWakeOut == 0 || candidate < nextWakeOut)) {
          nextWakeOut = candidate;
        }
      };
      if (nextDisplay > nowEpoch) {
        const time_t lead = static_cast<time_t>(cfg.prefetch_lead_minutes) * 60;
        consider(nextDisplay > lead ? nextDisplay - lead : nextDisplay);
      }
      consider(nextSchedulePrefetch);
      consider(targetEnd);
      if (nextSyncOut > 0) consider(static_cast<time_t>(nextSyncOut));
    }
    if (nextSyncOut > nowEpoch
        && (nextWakeOut == 0 || nextSyncOut < nextWakeOut)) {
      nextWakeOut = nextSyncOut;
    }
    return;
  }
#endif
  struct tm localNow = {};
  localtime_r(&nowEpoch, &localNow);
  struct tm candidate = localNow;
  candidate.tm_hour = cfg.refresh_hour;
  candidate.tm_min = cfg.refresh_minute;
  candidate.tm_sec = 0;
  time_t candidateEpoch = mktime(&candidate);
  if (candidateEpoch <= nowEpoch) {
    candidate.tm_mday += 1;
    candidateEpoch = mktime(&candidate);
  }
  if (candidateEpoch > nowEpoch) nextWakeOut = candidateEpoch;
}

static String wakeReasonDetail() {
  switch (esp_sleep_get_wakeup_cause()) {
    case ESP_SLEEP_WAKEUP_TIMER: return "timer";
    case ESP_SLEEP_WAKEUP_EXT0:
    case ESP_SLEEP_WAKEUP_EXT1: return "user_button_or_external";
    case ESP_SLEEP_WAKEUP_UNDEFINED: return "power_on";
    default: return "other";
  }
}

#if INKTIME_PHOTOPAINTER_ENABLED
static bool activeHasDueFormalSlot(time_t nowEpoch) {
  if (nowEpoch <= 0) return false;
  String activeJson;
  if (!photoPainter.readActiveSchedule(activeJson)) return false;
  JsonDocument active;
  if (deserializeJson(active, activeJson) || active.overflowed()) return false;
  const JsonArrayConst slots = active["slots"].as<JsonArrayConst>();
  if (slots.isNull() || slots.size() == 0U || slots.size() > inktime::kMaxOfflineSlots) return false;
  int64_t showAtEpochs[inktime::kMaxOfflineSlots] = {};
  for (size_t index = 0; index < slots.size(); ++index) {
    const JsonVariantConst rawSlot = slots[index];
    if (!rawSlot.is<JsonObjectConst>()) {
      return false;
    }
    const JsonVariantConst rawShowAt = rawSlot["show_at_epoch"];
    if (!rawShowAt.is<int64_t>() || rawShowAt.is<bool>()) return false;
    showAtEpochs[index] = rawShowAt.as<int64_t>();
  }
  return inktime::scheduleHasDueFormalSlot(
    showAtEpochs, static_cast<uint8_t>(slots.size()), static_cast<uint64_t>(nowEpoch));
}

static bool offlinePrefetchWake(const Config &cfg, time_t nowEpoch) {
  if (cfg.delivery_mode != "inktime_offline_schedule" || nowEpoch <= 0) {
    return false;
  }
  String syncStrategy;
  String syncTime;
  if (!runtimeSyncFields(cfg, syncStrategy, syncTime)) return true;
  time_t nextDisplay = 0;
  time_t targetEnd = 0;
  time_t nextSchedulePrefetch = 0;
  if (!activeOfflineEpochs(nowEpoch, nextDisplay, targetEnd, nextSchedulePrefetch)) return true;
  if (targetEnd > 0 && nowEpoch >= targetEnd) return true;
  if (nextSchedulePrefetch > 0 && nowEpoch >= nextSchedulePrefetch
      && (targetEnd <= 0 || nowEpoch < targetEnd)) return true;
  if (syncStrategy == "fixed_daily") return false;
  if (cfg.prefetch_lead_minutes == 0) return false;
  if (nextDisplay <= nowEpoch) return false;
  const time_t lead = static_cast<time_t>(cfg.prefetch_lead_minutes) * 60;
  return nowEpoch >= nextDisplay - lead && nowEpoch < nextDisplay;
}

static bool offlineNextSchedulePrefetchDue(const Config &cfg, time_t nowEpoch) {
  if (cfg.delivery_mode != "inktime_offline_schedule" || nowEpoch <= 0) return false;
  time_t nextDisplay = 0;
  time_t targetEnd = 0;
  time_t nextSchedulePrefetch = 0;
  if (!activeOfflineEpochs(nowEpoch, nextDisplay, targetEnd, nextSchedulePrefetch)) return false;
  return nextSchedulePrefetch > 0 && nowEpoch >= nextSchedulePrefetch
      && targetEnd > nowEpoch;
}

